#Вот пример файла JSON с названиями оружия, их материалами, уроном, скоростью атаки и типом урона:

Simple= [  
 {  
 "название": "Деревянное копье",  
 "материал": "дерево",  
 "урон": "1d4",  
 "скорость атаки": "5",  
 "тип урона": "проникающий"  
 },  
 {  
 "название": "Бронзовая булава",  
 "материал": "бронза",  
 "урон": "1d6",  
 "скорость атаки": "4",  
 "тип урона": "дробящий"  
 },   
 {   
 "название": "Железное копьё",  
 "материал": "железо",  
 "урон": "1d8",  
 "скорость атаки": "3",  
 "тип урона": "проникающий"   
 },  
 {   
 "название": "Стальная секира",  
 "материал": "сталь",  
 "урон": "2d6",   
 "скорость атаки": "2", }] 
 
Items = {
    "Weapons" : {
        {
        "Swords": [
            {
                "Name": "Деревянный Меч",
                "Damage": "2-4",
                "Speed": "8f",
                "Type": "Режущий/Одноручный"
                "Scale" : "D Сила"
            
            },
            {
                "Name": "Бронзовый Меч",
                "Damage": "1-3",
                "Speed": "17f",
                "Type": "Режущий/Одноручный"
            
            },
            {
                "Name": "Железный Меч",
                "Damage": "2-4",
                "Speed": "6f",
                "Type": "Режущий/Одноручный"
            
            },
            {
                "Name": "Стальной Меч",
                "Damage": "3-5",
                "Speed": "22f",
                "Type": "Режущий/Одноручный"
            
            },
            {
                "Name": "Титановый Меч",
                "Damage": "4-6",
                "Speed": "8f",
                "Type": "Режущий/Одноручный"
           
            }
        ],
        "Maces": [
            {
                "Name": "Деревянная Дубина",
                "Damage": "1-5",
                "Speed": "10f",
                "Type": "Дробящий/Одноручная"
                "Scale" : "C Сила"
            },
            {
                "Name": "Бронзовая Дубина",
                "Damage": "1-3",
                "Speed": "21f",
                "Type": "Дробящий/Одноручная"
            
            },
            {
                "Name": "Железная Дубина",
                "Damage": "2-4",
                "Speed": "33f",
                "Type": "Дробящий/Одноручная"
            
            },
            {
                "Name": "Стальная Дубина",
                "Damage": "3-5",
                "Speed": "8f",
                "Type": "Дробящий/Одноручная"
            
            },
            {
                "Name": "Титановая Дубина",
                "Damage": "4-6",
                "Speed": "16f",
                "Type": "Дробящий/Одноручная"
           
            }
        ],
        "Spears": [
            {
                "Name": "Деревянное Копьё",
                "Damage": "3-7",
                "Speed": "14f",
                "Type": "Колучиший/Двухручное"
                "Scale" : "D Сила, D Ловкость"
            
            },
            {
                "Name": "Бронзовое Копьё",
                "Damage": "1-3",
                "Speed": "38f",
                "Type": "Колучиший/Двухручное"
            
            },
            {
                "Name": "Железное Копьё",
                "Damage": "2-4",
                "Speed": "23f",
                "Type": "Колучиший/Двухручное"
            
            },
            {
                "Name": "Стальное Копьё",
                "Damage": "3-5",
                "Speed": "18f",
                "Type": "Колучиший/Двухручное"
            
            },
            {
                "Name": "Титановое Копьё",
                "Damage": "4-6",
                "Speed": "28f",
                "Type": "Колучиший/Двухручное"
           
            }
        ],
        "Axes": [
            {
                "Name": "Деревянный Топор",
                "Damage": "2-3",
                "Speed": "7f",
                "Type": "Режущий/Одноручный"
                "Scale" : "С Сила"
            },
            {
                "Name": "Бронзовый Топор",
                "Damage": "1-3",
                "Speed": "15f",
                "Type": "Режущий/Одноручный"
            
            },
            {
                "Name": "Железный Топор",
                "Damage": "2-4",
                "Speed": "5f",
                "Type": "Режущий/Одноручный"
            
            },
            {
                "Name": "Стальный Топор",
                "Damage": "3-5",
                "Speed": "39f",
                "Type": "Режущий/Одноручный"
            
            },
            {
                "Name": "Титановый Топор",
                "Damage": "4-6",
                "Speed": "21f",
                "Type": "Режущий/Одноручный"
           
            }
        ],
        "Knifes": [
            {
                "Name": "Деревянный Нож",
                "Damage": "1-2",
                "Speed": "4f",
                "Type": "Колучиший/Одноручный"
                "Scale" : "B Ловкость"
            },
            {
                "Name": "Бронзовый Нож",
                "Damage": "1-3",
                "Speed": "6f",
                "Type": "Колучиший/Одноручный"
            
            },
            {
                "Name": "Железный Нож",
                "Damage": "2-4",
                "Speed": "11f",
                "Type": "Колучиший/Одноручный"
            
            },
            {
                "Name": "Стальный Нож",
                "Damage": "3-5",
                "Speed": "15f",
                "Type": "Колучиший/Одноручный"
            
            },
            {
                "Name": "Титановый Нож",
                "Damage": "4-6",
                "Speed": "22f",
                "Type": "Колучиший/Одноручный"
           
            }
        ],
        "Rapier": [
            {
                "Name": "Деревянная Рапира",
                "Damage": "1-4",
                "Speed": "7f",
                "Type": "Колучиший/Одноручная"
                "Scale" : "C Ловкость"
            },
            {
                "Name": "Бронзовая Рапира",
                "Damage": "1-3",
                "Speed": "37f",
                "Type": "Колучиший/Одноручная"
            
            },
            {
                "Name": "Железная Рапира",
                "Damage": "2-4",
                "Speed": "9f",
                "Type": "Колучиший/Одноручная"
            
            },
            {
                "Name": "Стальная Рапира",
                "Damage": "3-5",
                "Speed": "34f",
                "Type": "Колучиший/Одноручная"
            
            },
            {
                "Name": "Титановая Рапира",
                "Damage": "4-6",
                "Speed": "6f",
                "Type": "Колучиший/Одноручная"
           
            }
        ],
        "Bow": [
            {
                "Name": "Деревянный Лук",
                "Damage": "7-9",
                "Speed": "18f",
                "Type": "Дальний бой/Двухручный"
                "Scale" : "D Ловкость"
            
            },
            {
                "Name": "Бронзовый Лук",
                "Damage": "1-3",
                "Speed": "12f",
                "Type": "Дальний бой/Двухручный"
            
            },
            {
                "Name": "Железный Лук",
                "Damage": "2-4",
                "Speed": "15f",
                "Type": "Дальний бой/Двухручный"
            
            },
            {
                "Name": "Стальной Лук",
                "Damage": "3-5",
                "Speed": "12f",
                "Type": "Дальний бой/Двухручный"
            
            },
            {
                "Name": "Титановый Лук",
                "Damage": "4-6",
                "Speed": "21f",
                "Type": "Дальний бой/Двухручный"
           
            }
    ]
}
    
    "Armor" : {
        "Shelds" : [], 
        "Helmet" : [], 
        "Breastplace" : [], 
        "Gloves" : [], 
        "Boots" : [], 
 
    }, 
    
    "Magic" : {
        "Sticks" : [], 
        "Scrolls" : [], 
        "Leaves" : []
    }, 
    
    "Accessories" : {
        "Rings" : [], 
        "Amulets" : []
    } 
 } }
 
import random
Materials = ["Деревянн", "Бронзов", "Железн", "Стальн", "Титанов"]
for item in Items["Weapons"]:
    i = 0
    while i < len(Materials):
        Items["Weapons"][item].append({"Name" : f"{Materials[i]} {item}", "Damage" : f"{i}-{i+2}", "Speed" : f"{random.randint(5, 40)}f", "Type" : "Колучиший"})
        i +=
         1
print(Items["Weapons"])
